# DataFrame Manipulation

In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [3]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['Raju','Pandey','Srini','Sunil','Ashok']
column_heading = ['Age','Height','Weight']

In [4]:
df = pd.DataFrame(data = matrix_data, index = row_labels, columns= column_heading)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [5]:
print("\nThe 'Height' column\n", '-'*25, sep='')
print(df['Height'])

The 'Height' column
-------------------------
Raju      66
Pandey    70
Srini     62
Sunil     68
Ashok     62
Name: Height, dtype: int32

In [6]:
print("\nThe 'Height' and 'weight' columns indexed by passsing  A LIST\n",'-'*55, sep='')
print(df[['Height','Weight']])

The 'Height' and 'weight' columns indexed by passsing  A LIST
-------------------------------------------------------
        Height  Weight
Raju        66     140
Pandey      70     148
Srini       62     125
Sunil       68     160
Ashok       62     152

In [7]:
only_ht_wt = df[['Height','Weight']]

In [8]:
only_ht_wt

        Height  Weight
Raju        66     140
Pandey      70     148
Srini       62     125
Sunil       68     160
Ashok       62     152

In [9]:
print("\nthe Age column accesed by DOT method (NOt recommended)\n",'-'*55,sep='')
print(df.Age)

the Age column accesed by DOT method (NOt recommended)
-------------------------------------------------------
Raju      22
Pandey    42
Srini     30
Sunil     35
Ashok     25
Name: Age, dtype: int32

**Lets understand slicing perticular elements**

In [10]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [12]:
#select perticular index data using loc(index name)
df.loc['Raju']

Age        22
Height     66
Weight    140
Name: Raju, dtype: int32

In [13]:
print(df
    
     )

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [14]:
print("\nSelect Index and column for a perticular data\n")
print(df.loc['Pandey','Height'])

Select Index and column for a perticular data

70

In [15]:
print("select Index and list of column data\n")
print(df.loc['Ashok',['Height','Weight']])

select Index and list of column data

Height     62
Weight    152
Name: Ashok, dtype: int32

In [16]:
print("select Index and list of column data\n")
print(df.loc[['Srini','Sunil'],['Height','Weight']])

select Index and list of column data

       Height  Weight
Srini      62     125
Sunil      68     160

In [17]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

**Select data on condition**

In [18]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])

Rows with Height > 65 inch
-----------------------------------
        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Sunil    35      68     160

In [19]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

In [20]:
print(df[(booldf1) & (booldf2)])

        Age  Height  Weight
Pandey   42      70     148
Sunil    35      68     160

In [21]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [22]:
print("\nDataFrame with only age and weight column whose height > 65 inch\n",'-'*68, sep = '')
print(df[booldf1][['Age','Weight']])

DataFrame with only age and weight column whose height > 65 inch
--------------------------------------------------------------------
        Age  Weight
Raju     22     140
Pandey   42     148
Sunil    35     160

In [25]:
selected_candidates = df[booldf1][['Age','Weight']]
print(selected_candidates)

        Age  Weight
Raju     22     140
Pandey   42     148
Sunil    35     160

In [26]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [27]:
print("\nAfter resetting index\n",'-'*35,sep='')
print(df.reset_index())

After resetting index
-----------------------------------
    index  Age  Height  Weight
0    Raju   22      66     140
1  Pandey   42      70     148
2   Srini   30      62     125
3   Sunil   35      68     160
4   Ashok   25      62     152

In [30]:
print("Adding new profession\n")
df['Profession']= "Student Teacher Engineer Assistant Software".split()
print(df)

Adding new profession

        Age  Height  Weight Profession
Raju     22      66     140    Student
Pandey   42      70     148    Teacher
Srini    30      62     125   Engineer
Sunil    35      68     160  Assistant
Ashok    25      62     152   Software

In [31]:
print("setting profession column as index\n")
print(df.set_index('Profession'))

setting profession column as index

            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Assistant    35      68     160
Software     25      62     152